snlkuharlocal/src/InformationRegisters/ФР_ЮрЛицаПодразделений/ФР_ЮрЛицаПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФР_ЮрЛицаПодразделений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыПодразделений/ВидыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодразделений</name>
  <enumValues>
    <name>Торговое</name>
  </enumValues>
  <enumValues>
    <name>Управляющее</name>
  </enumValues>
  <enumValues>
    <name>Сервисное</name>
  </enumValues>
  <enumValues>
    <name>Франчайзинг</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/InformationRegisters/ФР_ЮрЛицаПодразделений/ManagerModule.bsl
Процедура Заполнить() Экспорт
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СкладПолучатель.Подразделение	КАК Подразделение,	
	|	ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).Контрагент КАК ЮрЛицо,
	|	
	|	МИНИМУМ(Дата) КАК Период
	|ИЗ
	|	Документ.Перемещение
	|ГДЕ 
	|	Проведен	
	|	И Склад.Подразделение.ВидПодразделения	<> ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|	И СкладПолучатель.Подразделение.ВидПодразделения	= ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)		
	|	И НЕ ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).Номер ЕСТЬ NULL
	|	И ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).Проведен = Истина
	|	И ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Отгружена)	
	|СГРУППИРОВАТЬ ПО 	
	|	СкладПолучатель.Подразделение,	
	|	ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).Контрагент
	|ИТОГИ МИНИМУМ(Период) ПО Подразделение";		
		
	
	ВыборкаПоПодразделениям=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Подразделение");
	Пока ВыборкаПоПодразделениям.Следующий() Цикл
		Выборка=ВыборкаПоПодразделениям.Выбрать();
		Пока Выборка.Следующий() Цикл
			МЗ	= РегистрыСведений.ФР_ЮрЛицаПодразделений.СоздатьМенеджерЗаписи();				
			ЗаполнитьЗначенияСвойств(МЗ,Выборка);		
			
			//Самая первая запись на 2014 год (из-за ввода остатков)
			Если Выборка.Период	= ВыборкаПоПодразделениям.Период И ГОД(ВыборкаПоПодразделениям.Период)=2015 Тогда		
				МЗ.Период=НачалоГода(МЗ.Период)-1;
			КонецЕсли;
			
			МЗ.Записать();		
		КонецЦикла;		
	КонецЦикла;	

КонецПроцедуры
 
Функция ПолучитьЮрЛицо(Подразделение,Знач Дата=Неопределено) Экспорт
	Если Дата=Неопределено Тогда
		Дата=ТекущаяДата();	
	КонецЕсли; 
	Отбор	= Новый Структура("Подразделение",Подразделение);
	Данные	= РегистрыСведений.ФР_ЮрЛицаПодразделений.ПолучитьПоследнее(НачалоДня(Дата),Отбор);
	
	Возврат Данные.ЮрЛицо;
КонецФункции //ПолучитьЮрЛицо(Подразделение,Знач Дата=Неопределено) Экспорт
